
Функция ЭлементПоИмени(Имя, ВызыватьИсключение = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрограммныеПродукты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПрограммныеПродукты КАК ПрограммныеПродукты
	|ГДЕ
	|	ПрограммныеПродукты.Имя = &ИмяПП";
	
	Запрос.УстановитьПараметр("ИмяПП", Имя);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НайденныйЭлемент = Неопределено;
	Если Выборка.Следующий() Тогда
		НайденныйЭлемент = Выборка.Ссылка;
	ИначеЕсли ВызыватьИсключение Тогда
		ВызватьИсключение НСтр(СтрШаблон("ru = 'Не найден программный продукт по имени ''%1'''", Имя));
	КонецЕсли; 
	Возврат НайденныйЭлемент;
КонецФункции
