#Область ПрограммныйИнтерфейс

Процедура ОтправитьСообщение(ТекстСообщения, КлючАналитики) Экспорт
	ПараметрыСообщения = RabbitMQКлиентСервер.НовыеПараметрыИсходящегоСообщения();
	ПараметрыПодключения = РегистрыСведений.ПараметрыRabbitMQ.ЗначенияПараметров();
	ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ПараметрыПодключения);
	ПараметрыСообщения.КлючМаршрутизации = ПараметрыПодключения["КлючМаршрутизации"][КлючАналитики];
	
	ПараметрыСообщения.ТекстСообщения = ТекстСообщения;
	
	КлиентКомпоненты = ПолучитьКомпоненту();
	RabbitMQКлиентСервер.ОтправитьСообщение(КлиентКомпоненты, ПараметрыСообщения);
КонецПроцедуры

Функция ПолучитьСообщение(ИмяОчереди, КэшируемыеЗначения = Неопределено) Экспорт
	Если КэшируемыеЗначения = Неопределено Тогда
		КэшируемыеЗначения = Новый Структура;
	КонецЕсли;
	
	ПараметрыСообщения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КэшируемыеЗначения, "ПараметрыСообщения");
	Если ПараметрыСообщения = Неопределено Тогда
		ПараметрыСообщения = RabbitMQКлиентСервер.НовыеПараметрыВходящегоСообщения();
		ПараметрыПодключения = РегистрыСведений.ПараметрыRabbitMQ.ЗначенияПараметров();
		ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ПараметрыПодключения);
	КонецЕсли;
	ПараметрыСообщения.ИмяОчереди = ИмяОчереди;
	КлиентКомпоненты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КэшируемыеЗначения, "КлиентКомпоненты");
	Если КлиентКомпоненты = Неопределено Тогда
		КлиентКомпоненты = ПолучитьКомпоненту();
		КэшируемыеЗначения.Вставить("КлиентКомпоненты", КлиентКомпоненты);
	КонецЕсли;
	
	Сообщение = RabbitMQКлиентСервер.ПрочитатьСообщение(КлиентКомпоненты, ПараметрыСообщения);
	Возврат Сообщение;
КонецФункции

Функция ОчередиДляПолученияСообщений() Экспорт
	ЗначенияПараметров = РегистрыСведений.ПараметрыRabbitMQ.ЗначенияПараметров();
	Если ТипЗнч(ЗначенияПараметров.ИмяОчереди) = Тип("Массив") Тогда
		Очереди = ЗначенияПараметров.ИмяОчереди; 
	Иначе
		Очереди = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначенияПараметров.ИмяОчереди); 
	КонецЕсли;
	Возврат Очереди;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьАдресМакетаКомпановки(УникальныйИдентификатор) Экспорт
	
	МакетВнешнейКомпоненты    = Обработки.ПримерРаботыСКомпонентойPinkRabbitMQ.ПолучитьМакет("ВнешняяКомпонента");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКомпоненту()
	
	КлиентКомпоненты = Неопределено;
	Если Не RabbitMQКлиентСервер.ИнициализироватьКомпоненту(КлиентКомпоненты) Тогда
		
		ПодключитьКомпоненту();
		RabbitMQКлиентСервер.ИнициализироватьКомпоненту(КлиентКомпоненты);
		
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
КонецФункции

Процедура ПодключитьКомпоненту(КомпонентаПодключена = Неопределено, ВыводитьСообщения = Ложь)
	
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпановки(Новый УникальныйИдентификатор);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			АдресВоВременномХранилище,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
	Если ВыводитьСообщения Тогда
		Сообщить(НСтр("ru = 'Компонента подключена!'"));
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти