
Процедура ПриВыполнении(Отказ)
	ТекПользователь = Пользователи.ТекущийПользователь();
	Если Исполнитель <> ТекПользователь Тогда
		Исполнитель = ТекПользователь;
	КонецЕсли;
	ДатаВыполнения = ТекущаяДатаСеанса();
	ЗафиксироватьЗамерВремениРаботыПоЗадаче();
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ДатаНачалаВМиллисекундах = ОценкаПроизводительности.НачатьЗамерВремени();
КонецПроцедуры

Процедура ЗафиксироватьЗамерВремениРаботыПоЗадаче()
	Если ЗначениеЗаполнено(ДатаНачалаВМиллисекундах) Тогда
		ИмяТочкиМаршрута = ТочкаМаршрута.Имя;
		ДанныеБП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БизнесПроцесс, "Номер, Статус");
		ОценкаПроизводительности.ЗакончитьЗамерВремени(
			СтрШаблон("ЗаявкаНаИзменениеВремяРаботыПоЗадаче%1", ИмяТочкиМаршрута),
			ДатаНачалаВМиллисекундах,, 
			СтрШаблон("%1,%2", ДанныеБП.Номер, ДанныеБП.Статус));
	КонецЕсли;
КонецПроцедуры
