
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	Если ТребуемыеПараметры = Неопределено Тогда
		ПараметрыСеанса.ТекущийПользователь = НайтиСоздатьТекущегоПользователя();
	КонецЕсли;
КонецПроцедуры

Функция НайтиСоздатьТекущегоПользователя()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяБазы = &ИмяТекПользователя";
	
	ИмяТекПользователя = ИмяПользователя();
	Запрос.УстановитьПараметр("ИмяТекПользователя", ИмяТекПользователя);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПользовательСсылка = Выборка.Ссылка;
	Иначе
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование = ИмяТекПользователя;
		НовыйПользователь.ИдентификаторПользователяБазы = ИмяТекПользователя;
		НовыйПользователь.Записать();
		ПользовательСсылка = НовыйПользователь.Ссылка
	КонецЕсли;
	
	Возврат ПользовательСсылка;
КонецФункции
