#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьСообщение(Наименование, ТекстСообщения, КлючМаршрутизации) Экспорт
	Элемент = Справочники.ИсходящиеСообщенияRabbitMQ.СоздатьЭлемент();
	Элемент.Наименование = Наименование;
	Элемент.ТекстСообщения = ТекстСообщения;
	Элемент.КлючМаршрутизации = КлючМаршрутизации;
	Элемент.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
