
#Область ПрограммныйИнтерфейс

Функция ОбъектВТекстСообщения(Объект, ПараметрыДляТранспортера = Неопределено) Экспорт
	ТипДанных = ТипДанныхПоОбъекту(Объект);
	Если НЕ ЗначениеЗаполнено(ТипДанных) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДанныеОбъекта = Вычислить(СтрШаблон("ОбъектВДанныеОбъекта_%1(Объект)", ТипДанных)); 
	Если ПараметрыДляТранспортера <> Неопределено Тогда
		ПараметрыДляТранспортера.Вставить("ТипДанных", ТипДанных);
	КонецЕсли;
	Возврат ДанныеВТекстСообщения(ТипДанных, ДанныеОбъекта);
КонецФункции

Процедура ПреобразоватьТекстСообщенияВОбъект(ТекстСообщения) Экспорт
	ДанныеСообщения = ТекстСообщенияВДанныеСообщения(ТекстСообщения);
	ИмяМетода = СтрШаблон("ПреобразоватьДанныеОбъектаВОбъект_%1(ДанныеСообщения.Данные);", ДанныеСообщения.ТипОбъекта);
	Выполнить(ИмяМетода);
КонецПроцедуры

#КонецОбласти

#Область СлужбеныеПроцедурыИФункции

Функция ТипДанныхПоОбъекту(Объект)
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("ФормаКлиентскогоПриложения") Тогда
		ТипОбъекта = Объект.ИмяФормы;
	КонецЕсли;
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Тип("СправочникОбъект.ПрограммныеПродукты"), "ПрограммныйПродукт");
	Соответствие.Вставить("ОбщаяФорма.трекер_ЗаявкаНаИзменение", "ЗаявкаНаИзменение");
	Возврат Соответствие.Получить(ТипОбъекта);
КонецФункции

Функция МодульКоннекторHTTP()
	Возврат трекер_КоннекторHTTP;
КонецФункции

Функция МенеджерСправочникаПрограммныхПродуктов()
	Возврат Справочники.трекер_ПрограммныеПродукты;
КонецФункции

Функция ОписаниеДанныхТипа(ТипОбъекта) 
	ОписаниеТипа = Вычислить(СтрШаблон("ОписаниеДанныхТипа_%1()", ТипОбъекта));
	Возврат ОписаниеТипа;
КонецФункции

Функция ДанныеВТекстСообщения(ТипОбъекта, Данные) 
	ОписаниеТипа = Новый Структура;
	ОписаниеТипа.Вставить("ТипОбъекта", ТипОбъекта);
	ОписаниеТипа.Вставить("Данные", Данные);
	ТекстСообщения = МодульКоннекторHTTP().ОбъектВJson(ОписаниеТипа);
	Возврат ТекстСообщения;
КонецФункции

Функция ТекстСообщенияВДанныеСообщения(ТекстСообщения)
	ДанныеСообщения = МодульКоннекторHTTP().JsonВОбъект(ТекстСообщения,, Новый Структура("ПрочитатьВСоответствие", Ложь));
	ТипОбъекта = ДанныеСообщения.ТипОбъекта;
	ДанныеОбъектаИзСообщения = ДанныеСообщения.Данные;
	ДанныеОбъекта = ОписаниеДанныхТипа(ТипОбъекта);
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ДанныеОбъектаИзСообщения);
	// Заменяем на нормализованную структуру данных объекта
	ДанныеСообщения.Вставить("Данные", ДанныеОбъекта);
	Возврат ДанныеСообщения;
КонецФункции

#Область ЗаявкаНаИзменение

Функция ОписаниеДанныхТипа_ЗаявкаНаИзменение() 
	ОписаниеТипа = Новый Структура;
	ОписаниеТипа.Вставить("Заказчик");
	ОписаниеТипа.Вставить("ПрограммныйПродукт");
	ОписаниеТипа.Вставить("ПервичноеОбращение");
	
	Возврат ОписаниеТипа;
КонецФункции

Функция ОбъектВДанныеОбъекта_ЗаявкаНаИзменение(Объект)
	ДанныеОбъекта = ОписаниеДанныхТипа_ЗаявкаНаИзменение();
	ДанныеОбъекта.Заказчик = ИмяПользователя();
	ДанныеОбъекта.ПрограммныйПродукт = Объект.ПрограммныйПродукт.Имя;
	ДанныеОбъекта.ПервичноеОбращение = Объект.ПервичноеОбращение;
	Возврат ДанныеОбъекта;
КонецФункции

#КонецОбласти

#Область ПрограммныйПродукт

Функция ОписаниеДанныхТипа_ПрограммныйПродукт() 
	ОписаниеТипа = Новый Структура;
	ОписаниеТипа.Вставить("Ссылка");
	ОписаниеТипа.Вставить("Наименование");
	ОписаниеТипа.Вставить("Имя");
	
	Возврат ОписаниеТипа;
КонецФункции

Процедура ПреобразоватьДанныеОбъектаВОбъект_ПрограммныйПродукт(ДанныеОбъекта)
	Менеджер = МенеджерСправочникаПрограммныхПродуктов();
	СсылкаНаОбъект = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеОбъекта.Ссылка));
	Если трекер_ОбщегоНазначения.СсылкаСуществует(СсылкаНаОбъект) Тогда
		Объект = СсылкаНаОбъект.ПолучитьОбъект();
	Иначе // поиск по реквизиту Имя
		СсылкаНаОбъект = Менеджер.НайтиПоРеквизиту("Имя", ДанныеОбъекта.Имя);
		Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Объект = СсылкаНаОбъект.ПолучитьОбъект();
		Иначе
			Объект = Менеджер.СоздатьЭлемент();
			Объект.УстановитьСсылкуНового(СсылкаНаОбъект);
		КонецЕсли;
	КонецЕсли;
	
	Объект.Наименование = ДанныеОбъекта.Наименование;
	Объект.Имя = ДанныеОбъекта.Имя;
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
