
#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьДанные(Объект) Экспорт
	 
	КонвертерОбъект = ИспользуемыйКонвертер();
	ТранспортерОбъект = ИспользуемыйТранспортер();
	
	ТранспортерОбъект.СформироватьИОтправитьСообщение(Объект, КонвертерОбъект);
	
КонецПроцедуры

Процедура ЗагрузитьДанные() Экспорт
	
	КонвертерОбъект = ИспользуемыйКонвертер();
	ТранспортерОбъект = ИспользуемыйТранспортер();
	
	ТранспортерОбъект.ЗагрузитьСообщения(КонвертерОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриЗаписиОбъектаОбменДаннымиОбработчикПодписки(Объект, Отказ) Экспорт
	ВыгрузитьДанные(Объект);
КонецПроцедуры
 
Процедура ЗагрузкаДанныхОбработчикЗадания() Экспорт
	ЗагрузитьДанные();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуемыйКонвертер()
	// Состав API:
	// - функция ОбъектВТекстСообщения(Объект, ПараметрыДляТранспортера){Возврат ТекстСообщения}
	// - процедура ПреобразоватьТекстСообщенияВОбъект(ТекстСообщения)
	Возврат Конвертер;
КонецФункции

Функция ИспользуемыйТранспортер()
	// Состав API:
	// - процедура ЗагрузитьСообщения(ОбъектКонвертер)
	// - процедура СформироватьИОтправитьСообщение(Объект, ОбъектКонвертер)
	Возврат RabbitMQ;
КонецФункции

#КонецОбласти

