
#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьДанные(Объект) Экспорт
	 
	КонвертерОбъект = ИспользуемыйКонвертер();
	ТранспортерОбъект = ИспользуемыйТранспортер();
	
	ВспомогательныеПараметры = Новый Структура;
	ТекстСообщения = КонвертерОбъект.ОбъектВТекстСообщения(Объект, ВспомогательныеПараметры);
	Если ТекстСообщения = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ТранспортерОбъект.ДобавитьИсходящееСообщение(ТекстСообщения, ВспомогательныеПараметры);
КонецПроцедуры

Процедура ЗагрузитьДанные() Экспорт
	КонвертерОбъект = ИспользуемыйКонвертер();
	ТранспортерОбъект = ИспользуемыйТранспортер();
	
	ТранспортерОбъект.ЗагрузитьСообщения(КонвертерОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриЗаписиОбъектаОбработчикПодписки(Объект, Отказ) Экспорт
	ВыгрузитьДанные(Объект);
КонецПроцедуры
 
Процедура ЗагрузкаДанныхОбработчикЗадания() Экспорт
	ЗагрузитьДанные();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ИспользуемыйКонвертер()
	// Состав API:
	// - функция ОбъектВТекстСообщения(Объект, ПараметрыДляТранспортера){Возврат ТекстСообщения}
	// - процедура ПреобразоватьТекстСообщенияВОбъект(ТекстСообщения)
	Возврат Конвертер;
КонецФункции

Функция ИспользуемыйТранспортер()
	// Состав API:
	// - процедура ЗагрузитьСообщения(ОбъектКонвертер)
	// - процедура ДобавитьИсходящееСообщение(ТекстСообщения, ДополнительныеПараметры)
	// - процедура ОтправитьСообщение(ТекстСообщения, ДополнительныеПараметры)
	Возврат RabbitMQ;
КонецФункции

#КонецОбласти

