
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриЗаписиОбъектаОбменДаннымиОбработчикПодписки(Источник, Отказ) Экспорт
	
	ТипОбъекта = "";
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		ТекстСообщения = Конвертер.ОбъектВТекстСообщения(Источник, ТипОбъекта);
		RabbitMQ.ОтправитьСообщение(ТекстСообщения, ТипОбъекта);
	КонецЕсли;
	
КонецПроцедуры
 
Процедура ЗагрузкаДанныхОбработчикЗадания() Экспорт
	ЗагрузитьДанныеИзRabbitMQ();
КонецПроцедуры

Процедура ЗагрузитьДанныеИзRabbitMQ() Экспорт
	КоличествоЗаявок = 0;
	Кэш = Неопределено;
	
	Очереди = трекер_RabbitMQ.ОчередиДляПолученияСообщений();
	Для Каждого Очередь Из Очереди Цикл
		Пока Истина Цикл
			ТекстСообщения = трекер_RabbitMQ.ПолучитьСообщение(Очередь, Кэш);
			Если ТекстСообщения <> Неопределено Тогда
				трекер_Конвертер.ПреобразоватьТекстСообщенияВОбъект(ТекстСообщения);
				КоличествоЗаявок = КоличествоЗаявок + 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Сообщить(СтрШаблон("Загружено заявок на изменение: %1", КоличествоЗаявок));
КонецПроцедуры

#КонецОбласти