
#Область СлужебныйПрограммныйИнтерфейс
 
Процедура ЗагрузкаДанныхОбработчикЗадания() Экспорт
	ЗагрузитьДанные();
КонецПроцедуры

Процедура ЗагрузитьДанные() Экспорт
	КоличествоЗаявок = 0;
	Кэш = Неопределено;
	
	Очереди = трекер_RabbitMQ.ОчередиДляПолученияСообщений();
	Для Каждого Очередь Из Очереди Цикл
		Пока Истина Цикл
			ТекстСообщения = трекер_RabbitMQ.ПолучитьСообщение(Очередь, Кэш);
			Если ТекстСообщения <> Неопределено Тогда
				трекер_Конвертер.ПреобразоватьТекстСообщенияВОбъект(ТекстСообщения);
				КоличествоЗаявок = КоличествоЗаявок + 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Сообщить(СтрШаблон("Загружено заявок на изменение: %1", КоличествоЗаявок));
КонецПроцедуры

#КонецОбласти