
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрограммныйПродукт = Константы.трекер_ТекущийПрограммныйПродукт.Получить();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтправитьЗаявку(Команда)
	Если НЕ ЗначениеЗаполнено(ПрограммныйПродукт) Тогда
		Ждать ПредупреждениеАсинх(СтрШаблон("Заполните поле %1", Элементы.ПрограммныйПродукт.Заголовок),, "Ошибка");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ПервичноеОбращение) Тогда
		Ждать ПредупреждениеАсинх(Элементы.ПервичноеОбращение.Заголовок,, "Ошибка");
		Возврат;
	КонецЕсли;
	ОтправитьЗаявкуНаСервере();
	
	Ждать ПредупреждениеАсинх("Заявка отправлена",, " ");
	
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗаявкуНаСервере()
	
	ТипОбъекта = "ЗаявкаНаИзменение";
	ТекстСообщения = трекер_Конвертер.ОбъектВТекстСообщения(ЭтотОбъект, ТипОбъекта);
	трекер_RabbitMQ.ОтправитьСообщение(ТекстСообщения, ТипОбъекта);
	
КонецПроцедуры
