
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрограммныйПродукт = Константы.трекер_ТекущийПрограммныйПродукт.Получить();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтправитьЗаявку(Команда)
	Если НЕ ЗаявкаЗаполненаКорректно() Тогда
		Ждать ПредупреждениеАсинх("Ошибка заполнения заявки");
		Возврат;
	КонецЕсли;
	ОтправитьЗаявкуНаСервере();
	
	Ждать ПредупреждениеАсинх("Заявка отправлена");
	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Функция ЗаявкаЗаполненаКорректно()
	ЗаявкаЗаполненаКорректно = Истина;
	Если НЕ ЗначениеЗаполнено(ПрограммныйПродукт) Тогда
		Сообщить(СтрШаблон("Заполните поле %1", Элементы.ПрограммныйПродукт.Заголовок));
		ЗаявкаЗаполненаКорректно = Ложь;
	КонецЕсли;
	Если ПустаяСтрока(ПервичноеОбращение) Тогда
		Сообщить(Элементы.ПервичноеОбращение.Заголовок);
		ЗаявкаЗаполненаКорректно = Ложь;
	КонецЕсли; 
	Возврат ЗаявкаЗаполненаКорректно;
КонецФункции

&НаСервере
Процедура ОтправитьЗаявкуНаСервере()
	
	трекер_ОбменДанными.ВыгрузитьДанные(ЭтотОбъект);
	
КонецПроцедуры
