
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрограммныйПродукт = Константы.трекер_ТекущийПрограммныйПродукт.Получить();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтправитьЗаявку(Команда)
	Если ПустаяСтрока(ПервичноеОбращение) Тогда
		Ждать ПредупреждениеАсинх(Элементы.ПервичноеОбращение.Заголовок);
		Возврат;
	КонецЕсли;
	ОтправитьЗаявкуНаСервере();
	
	Ждать ПредупреждениеАсинх("Заявка отправлена");
	
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗаявкуНаСервере()
	
	ТипОбъекта = "ЗаявкаНаИзменение";
	ТекстСообщения = трекер_Конвертер.ОбъектВТекстСообщения(ЭтотОбъект, ТипОбъекта);
	трекер_RabbitMQ.ОтправитьСообщение(ТекстСообщения, ТипОбъекта);
	
КонецПроцедуры
