
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрограммныйПродукт = Константы.трекер_ТекущийПрограммныйПродукт.Получить();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтправитьЗаявку(Команда)
	Если ПустаяСтрока(Описание) Тогда
		Ждать ПредупреждениеАсинх(Элементы.Описание.Заголовок);
		Возврат;
	КонецЕсли;
	ОтправитьЗаявкуНаСервере();
	
	Ждать ПредупреждениеАсинх("Заявка отправлена");
	
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗаявкуНаСервере()
	
	трекер_RabbitMQ.ОтправитьСообщениеВОчередьRabbitMQ(ДанныеВТекстСообщения(), "Заявки");
	
КонецПроцедуры

&НаСервере
Функция ДанныеВТекстСообщения()
	ДанныеСообщения = Новый Структура;
	ДанныеСообщения.Вставить("Заказчик", ИмяПользователя());
	ДанныеСообщения.Вставить("ПрограммныйПродукт", ПрограммныйПродукт.Имя);
	ДанныеСообщения.Вставить("Описание", Описание);
	ТекстСообщения = трекер_КоннекторHTTP.ОбъектВJson(ДанныеСообщения);
	Возврат ТекстСообщения;
КонецФункции
