
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Запись.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
		Если НЕ ЗначениеЗаполнено(Запись.ЗаявкаНаИзменение) Тогда
			Параметры.Свойство("ЗаявкаНаИзменение", Запись.ЗаявкаНаИзменение);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Запись.Задача) Тогда
			Параметры.Свойство("Задача", Запись.Задача);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Запись.ЗаявкаНаИзменение) 
			И ЗначениеЗаполнено(Запись.Задача) Тогда
			Запись.ЗаявкаНаИзменение = Запись.Задача.БизнесПроцесс;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
