
&НаСервереБезКонтекста
Функция ДанныеТекущейЗадачи(СсылкаНаЗадачу)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаИзменение.Заказчик КАК Заказчик,
	|	ЗаявкаНаИзменение.ПрограммныйПродукт КАК ПрограммныйПродукт,
	|	ЗаявкаНаИзменение.ПервичноеОбращение КАК ПервичноеОбращение,
	|	ЗаявкаНаИзменение.Описание КАК Описание
	|ИЗ
	|	БизнесПроцесс.ЗаявкаНаИзменение КАК ЗаявкаНаИзменение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ПО ЗаявкаНаИзменение.Ссылка = ЗадачаИсполнителя.БизнесПроцесс
	|			И (ЗадачаИсполнителя.Ссылка = &СсылкаНаЗадачу)";
	
	Запрос.УстановитьПараметр("СсылкаНаЗадачу", СсылкаНаЗадачу);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Результат = Новый Структура("Заказчик, ПрограммныйПродукт, ПервичноеОбращение, Описание");
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеТекущейЗадачи(Элементы.Список.ТекущиеДанные.Ссылка));
КонецПроцедуры
